{
"title": "Engineering Company for Welding Technology Co.",
"title_1": "Engineering Company for Welding Technology",
"nav_services": "Our Services",
"text_1": "The best welding services with high quality",
"text_2": "We provide advanced welding solutions for all industries",

"contact_text":"Contact Us",
"nav_about": "About Us",
"aboutus_1":"Over twenty years of experience in the field of specialized welding, during which I have witnessed the stages of technological development of alloys and how to handle them through welding. To date, thank God, we have proven our proficiency in welding all types of different alloys, for example, welding steel and stainless steel, copper alloys, and cold and hot metal spraying processes. The company's primary and ultimate goal is to serve the industry by manufacturing and maintaining spare parts in the shortest possible time. ",
"aboutus_2":"Cold and unheated cast iron welding: machine bases, cylinder blocks, gearbox blanks, cylinder seals, gears, pump blanks, casting treatment, printing rolls. ",
"aboutus_3":"Welding and supplying steel and non-ferrous metals: cams, dies, hot and cold cutting knives, pressure vessels, gears, axles and shafts, plastic machine screws, the ability to weld steel and stainless parts with Copper Alloys",
"aboutus_4":"Hot and Cold Powder Spraying: Dies, Castings, Motor Rotors, Columns - Column Bearings.",
"aboutus_5":"Manufacturing Field: (For example, but not limited to) Previous experience in manufacturing stainless steel and iron tanks of various diameters and shapes + manufacturing product transfer rigs + manufacturing bucket elevators, heat exchangers, castings, hoppers, and rams. Manufacturing and installation work for production lines in factories.",
"nav_about1": "Over 20 years of experience in manufacturing and maintaining spare parts and machine parts using the latest specialized welding and metal processing technologies, providing fast and reliable industrial solutions that support continued production with high efficiency.",
"botton_more": "More..",

"service_electric": "Electric Welding",
"service_electric1": "Different types of welding, including cast iron welding, copper welding, and others.",
"service_make": "Manufacturing",
"service_make1": "Manufacturing feed trailers and others.",
"nav_contact": "Contact Us",
"hero_heading": "The Best Welding Services with High Quality",

"hero_subtext": "We provide advanced welding solutions for all industries.",

"contact_us": "Contact Us Now",
"logo": "Company Logo",
"contact_1":"You can contact us directly",
"contact_2":"or Following Numbers",
"contact_3":"Email",
"contact_4":"WhatsApp",

"contact_text1":"Location",
"about_footer":"More than 20 years of experience in the field of welding and manufacturing, and we are still continuing to provide you with the best.",
"foteer_1":"Links",
"foteer_11":"Home",
"foteer_2":"Follow Us ",
"contact_text2":" Engineering Company for Welding Technology All rights reserved. © 2025"
}
